fasmide/esp32_calthing/esp32ui/src/main.cpp
// ESP32 full-screen agenda UI backed by the calendar daemon.

#include <Arduino.h>
#include <ArduinoJson.h>
#include <Arduino_GFX_Library.h>
#include <ESP32_4848S040.h>
#include <HTTPClient.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <lvgl.h>
#include <freertos/FreeRTOS.h>
#include <freertos/semphr.h>
#include <sys/time.h>
#include <time.h>

#if __has_include("app_config.h")
#include "app_config.h"
#else
#include "app_config.example.h"
#endif
#include "touch.h"

SET_LOOP_TASK_STACK_SIZE(16 * 1024);

LV_FONT_DECLARE(app_font_14);
LV_FONT_DECLARE(app_font_16);
LV_FONT_DECLARE(app_font_20);
LV_FONT_DECLARE(app_font_24);

#define GFX_BL 38

#define BLACK 0x0000

#define TFT_HOR_RES 480
#define TFT_VER_RES 480
#define TFT_ROTATION LV_DISPLAY_ROTATION_0
#define TFT_BRIGHTNESS 255
#define FRAMEBUFFER_SIZE (TFT_HOR_RES * TFT_VER_RES * sizeof(uint16_t))
// A small RGB bounce buffer removes nearly all idle flicker on this panel.
#define TFT_BOUNCE_BUFFER_PX (TFT_HOR_RES * 10)

#define APP_EVENT_CAPACITY 96
#define APP_EVENT_PAGE_LIMIT 12
#define APP_QUERY_DAYS 7
#define APP_REFRESH_INTERVAL_MS (5UL * 60UL * 1000UL)
#define APP_PULL_REFRESH_THRESHOLD 80
#define APP_NTP_RETRY_INTERVAL_MS 30000UL

#define EVENT_START_COLOR 0x6EE7B7
#define EVENT_END_COLOR 0xFF8A65

Arduino_ESP32SPI *bus;
Arduino_RGB_Display *gfx;
Arduino_ESP32RGBPanel *rgbpanel;
uint16_t *framebufferA;
uint16_t *framebufferB;
SemaphoreHandle_t displayVsyncSemaphore;

struct CalendarEvent {
  String id;
  String title;
  String description;
  String location;
  time_t startTs;
  time_t endTs;
  time_t createdTs;
  bool allDay;
};

enum EventTimingState {
  EVENT_TIMING_NONE,
  EVENT_TIMING_UPCOMING,
  EVENT_TIMING_ONGOING,
};

struct AppState {
  CalendarEvent events[APP_EVENT_CAPACITY];
  int eventCount = 0;
  time_t rangeStart = 0;
  time_t rangeEnd = 0;
  time_t lastSyncTs = 0;
  time_t lastRenderMinuteTs = 0;
  unsigned long lastRefreshMs = 0;
  bool refreshRequested = true;
  bool fetchInProgress = false;
  bool wifiReady = false;
  bool clockReady = false;
  bool pullRefreshArmed = false;
  bool pullRefreshInProgress = false;
  bool refreshDeferredToNextLoop = false;
  unsigned long refreshOverlayShownAt = 0;
  unsigned long lastClockSyncAttemptMs = 0;
  String statusText;
  String detailText;
  String openDetailEventId;
} app;

static lv_style_t style_screen;
static lv_style_t style_day_panel;
static lv_style_t style_event_card;
static lv_style_t style_modal;
static lv_style_t style_fab;
static lv_style_t style_status;

static lv_obj_t *agenda_panel;
static lv_obj_t *status_pill;
static lv_obj_t *status_label;
static lv_obj_t *back_button;
static lv_obj_t *detail_overlay;
static lv_obj_t *detail_title_label;
static lv_obj_t *detail_body_label;
static lv_obj_t *refresh_overlay;
static lv_obj_t *refresh_label;

void my_disp_flush(lv_display_t *disp, const lv_area_t *area, uint8_t *px_map) {
  LV_UNUSED(area);
  // In direct mode LVGL renders into the inactive full-screen buffer. Only swap
  // on the last flush of a frame, and only after the next VSYNC.
  if (lv_display_flush_is_last(disp)) {
    if (displayVsyncSemaphore != nullptr) {
      xSemaphoreTake(displayVsyncSemaphore, portMAX_DELAY);
    }
    rgbpanel->drawBitmap(0, 0, TFT_HOR_RES, TFT_VER_RES, px_map);
  }

  lv_disp_flush_ready(disp);
}

bool onRgbVsync(esp_lcd_panel_handle_t panel, const esp_lcd_rgb_panel_event_data_t *edata, void *user_ctx) {
  LV_UNUSED(panel);
  LV_UNUSED(edata);
  BaseType_t highTaskWoken = pdFALSE;
  SemaphoreHandle_t semaphore = static_cast<SemaphoreHandle_t>(user_ctx);
  if (semaphore != nullptr) {
    xSemaphoreGiveFromISR(semaphore, &highTaskWoken);
  }
  return highTaskWoken == pdTRUE;
}

void my_touchpad_read(lv_indev_t *indev, lv_indev_data_t *data) {
  if (touch_has_signal() && touch_touched()) {
    data->state = LV_INDEV_STATE_PRESSED;
    data->point.x = touch_last_x;
    data->point.y = touch_last_y;
    return;
  }

  data->state = LV_INDEV_STATE_RELEASED;
}

static uint32_t my_tick(void) {
  return millis();
}

bool hasAppConfig() {
  return strlen(APP_WIFI_SSID) > 0 && strlen(APP_DAEMON_URL) > 0 && strlen(APP_API_TOKEN) > 0;
}

String daemonBaseUrl() {
  String baseUrl = String(APP_DAEMON_URL);
  while (baseUrl.endsWith("/")) {
    baseUrl.remove(baseUrl.length() - 1);
  }
  return baseUrl;
}

bool isClockValid(time_t now) {
  return now >= 1700000000;
}

void requestTimeSync() {
  configTzTime(APP_TIMEZONE, "pool.ntp.org", "time.nist.gov");
  app.lastClockSyncAttemptMs = millis();
}

time_t buildTimestampUtc() {
  static const char *months = "JanFebMarAprMayJunJulAugSepOctNovDec";
  char monthText[4] = {};
  int day = 0;
  int year = 0;
  int hour = 0;
  int minute = 0;
  int second = 0;

  if (sscanf(__DATE__, "%3s %d %d", monthText, &day, &year) != 3) {
    return 0;
  }
  if (sscanf(__TIME__, "%d:%d:%d", &hour, &minute, &second) != 3) {
    return 0;
  }

  const char *monthPos = strstr(months, monthText);
  if (monthPos == nullptr) {
    return 0;
  }

  struct tm parts = {};
  parts.tm_year = year - 1900;
  parts.tm_mon = static_cast<int>((monthPos - months) / 3);
  parts.tm_mday = day;
  parts.tm_hour = hour;
  parts.tm_min = minute;
  parts.tm_sec = second;
  parts.tm_isdst = 0;

  const char *previousTz = getenv("TZ");
  setenv("TZ", "UTC0", 1);
  tzset();
  const time_t timestamp = mktime(&parts);
  if (previousTz != nullptr) {
    setenv("TZ", previousTz, 1);
  } else {
    unsetenv("TZ");
  }
  tzset();
  return timestamp;
}

bool bootstrapClockFromBuildTime() {
  if (isClockValid(time(nullptr))) {
    Serial.printf("Clock already valid: %lld\n", static_cast<long long>(time(nullptr)));
    return true;
  }

  const time_t buildTime = buildTimestampUtc();
  Serial.printf("Build timestamp UTC: %lld\n", static_cast<long long>(buildTime));
  if (!isClockValid(buildTime)) {
    Serial.println("Build timestamp invalid");
    return false;
  }

  timeval now = {};
  now.tv_sec = buildTime;
  now.tv_usec = 0;
  if (settimeofday(&now, nullptr) != 0) {
    Serial.println("settimeofday failed");
    return false;
  }

  Serial.printf("Clock after bootstrap: %lld\n", static_cast<long long>(time(nullptr)));
  return isClockValid(time(nullptr));
}

String urlEncode(const String &value) {
  String encoded;
  const char *hex = "0123456789ABCDEF";

