fasmide/esp32_calthing/esp32ui/src/main.cpp
  for (size_t i = 0; i < value.length(); ++i) {
    const char c = value.charAt(i);
    const bool unreserved = isalnum(static_cast<unsigned char>(c)) || c == '-' || c == '_' || c == '.' || c == '~';
    if (unreserved) {
      encoded += c;
      continue;
    }

    encoded += '%';
    encoded += hex[(c >> 4) & 0x0F];
    encoded += hex[c & 0x0F];
  }

  return encoded;
}

time_t startOfLocalDay(time_t value) {
  struct tm parts;
  localtime_r(&value, &parts);
  parts.tm_hour = 0;
  parts.tm_min = 0;
  parts.tm_sec = 0;
  return mktime(&parts);
}

String formatRfc3339(time_t value) {
  struct tm parts;
  gmtime_r(&value, &parts);

  char buffer[32];
  strftime(buffer, sizeof(buffer), "%Y-%m-%dT%H:%M:%SZ", &parts);
  return String(buffer);
}

String formatDayTitle(time_t value) {
  struct tm parts;
  localtime_r(&value, &parts);

  char buffer[48];
  strftime(buffer, sizeof(buffer), "%A", &parts);
  return String(buffer);
}

String formatDaySubtitle(time_t value) {
  struct tm parts;
  localtime_r(&value, &parts);

  char buffer[48];
  strftime(buffer, sizeof(buffer), "%d %b %Y", &parts);
  return String(buffer);
}

String formatRelativeDuration(time_t seconds);

String formatCurrentTime(time_t value) {
  struct tm parts;
  localtime_r(&value, &parts);

  char buffer[16];
  strftime(buffer, sizeof(buffer), "%H:%M", &parts);
  return String(buffer);
}

String formatTimeRange(const CalendarEvent &event) {
  if (event.allDay) {
    return "All day";
  }

  struct tm startParts;
  struct tm endParts;
  localtime_r(&event.startTs, &startParts);
  localtime_r(&event.endTs, &endParts);

  char startBuffer[16];
  char endBuffer[16];
  strftime(startBuffer, sizeof(startBuffer), "%H:%M", &startParts);
  strftime(endBuffer, sizeof(endBuffer), "%H:%M", &endParts);

  return String(startBuffer) + " - " + endBuffer + " (" + formatRelativeDuration(event.endTs - event.startTs) + ")";
}

String formatRelativeDuration(time_t seconds) {
  if (seconds < 0) {
    seconds = -seconds;
  }

  const long days = seconds / 86400;
  seconds %= 86400;
  const long hours = seconds / 3600;
  const long minutes = (seconds % 3600) / 60;

  String result;
  if (days > 0) {
    result += String(days) + "d";
  }
  if (hours > 0) {
    if (!result.isEmpty()) {
      result += " ";
    }
    result += String(hours) + "h";
  }
  if (minutes > 0 || result.isEmpty()) {
    if (!result.isEmpty()) {
      result += " ";
    }
    result += String(minutes) + "m";
  }
  return result;
}

EventTimingState getEventTimingState(const CalendarEvent &event) {
  if (event.allDay) {
    return EVENT_TIMING_NONE;
  }

  const time_t now = time(nullptr);
  if (now < 1700000000) {
    return EVENT_TIMING_NONE;
  }

  if (now < event.startTs) {
    return EVENT_TIMING_UPCOMING;
  }
  if (now < event.endTs) {
    return EVENT_TIMING_ONGOING;
  }
  return EVENT_TIMING_NONE;
}

String formatEventStatus(const CalendarEvent &event) {
  const EventTimingState state = getEventTimingState(event);
  if (state == EVENT_TIMING_UPCOMING) {
    return formatRelativeDuration(event.startTs - time(nullptr));
  }
  if (state == EVENT_TIMING_ONGOING) {
    return formatRelativeDuration(event.endTs - time(nullptr));
  }
  return "";
}

lv_color_t getEventTimingColor(EventTimingState state) {
  if (state == EVENT_TIMING_UPCOMING) {
    return lv_color_hex(EVENT_START_COLOR);
  }
  if (state == EVENT_TIMING_ONGOING) {
    return lv_color_hex(EVENT_END_COLOR);
  }
  return lv_color_hex(0xD2DCEB);
}

String colorizeStatusText(const String &text, EventTimingState state) {
  if (text.isEmpty() || state == EVENT_TIMING_NONE) {
    return text;
  }

  char color[8];
  const uint32_t value = state == EVENT_TIMING_UPCOMING ? EVENT_START_COLOR : EVENT_END_COLOR;
  snprintf(color, sizeof(color), "%06lX", static_cast<unsigned long>(value));
  return String("#") + color + " " + text + "#";
}

String formatCreatedTimestamp(time_t value) {
  if (value <= 0) {
    return "Unknown";
  }

  struct tm parts;
  localtime_r(&value, &parts);

  char buffer[32];
  strftime(buffer, sizeof(buffer), "%Y-%m-%d %H:%M:%S", &parts);
  return String(buffer);
}

void setStatus(const String &text, bool visible) {
  const bool currentlyVisible = status_pill != nullptr && !lv_obj_has_flag(status_pill, LV_OBJ_FLAG_HIDDEN);
  if (app.statusText == text && currentlyVisible == visible) {
    return;
  }

  app.statusText = text;
  if (status_label != nullptr) {
    lv_label_set_text(status_label, app.statusText.c_str());
  }
  if (status_pill != nullptr) {
    if (visible) {
      lv_obj_clear_flag(status_pill, LV_OBJ_FLAG_HIDDEN);
    } else {
      lv_obj_add_flag(status_pill, LV_OBJ_FLAG_HIDDEN);
    }
  }
}

void setRefreshOverlay(const String &text, bool visible) {
  if (refresh_overlay == nullptr || refresh_label == nullptr) {
    return;
  }

  if (visible && text.isEmpty()) {
    visible = false;
  }

  lv_label_set_text(refresh_label, text.c_str());
  if (visible) {
    app.refreshOverlayShownAt = millis();
    lv_obj_clear_flag(refresh_overlay, LV_OBJ_FLAG_HIDDEN);
    lv_obj_move_foreground(refresh_overlay);
  } else {
    if (!lv_obj_has_flag(refresh_overlay, LV_OBJ_FLAG_HIDDEN)) {
      const unsigned long elapsed = millis() - app.refreshOverlayShownAt;
      if (elapsed < 250) {
        const unsigned long remaining = 250 - elapsed;
        const unsigned long startedAt = millis();
        while (millis() - startedAt < remaining) {
          lv_timer_handler();
          delay(5);
        }
      }
    }
    lv_obj_add_flag(refresh_overlay, LV_OBJ_FLAG_HIDDEN);
  }
}

void hideDetailOverlay();

void onDetailBackdropPressed(lv_event_t *e) {
  LV_UNUSED(e);
  hideDetailOverlay();
}

void showDetailOverlay(const CalendarEvent &event) {
  if (detail_overlay == nullptr) {
    return;
  }

  app.openDetailEventId = event.id;

  lv_label_set_text(detail_title_label, event.title.c_str());

  String details = formatTimeRange(event);
  const EventTimingState timingState = getEventTimingState(event);
  const String relative = formatEventStatus(event);
  if (!relative.isEmpty()) {
    details += "\n";
    details += colorizeStatusText(relative, timingState);
  }
  if (!event.location.isEmpty()) {
    details += "\n";
    details += event.location;
  }
  if (!event.description.isEmpty()) {
    details += "\n\n";
    details += event.description;
  }
  details += "\nCreated ";
  details += formatCreatedTimestamp(event.createdTs);
  details += "\n\n";
  details += event.id;
  app.detailText = details;
  lv_label_set_text(detail_body_label, app.detailText.c_str());

