fasmide/esp32_calthing/esp32ui/src/main.cpp
void connectWifi() {
  if (!hasAppConfig()) {
    setStatus("Set Wi-Fi, daemon, token", true);
    return;
  }

  WiFi.mode(WIFI_STA);
  // RGB panel + PSRAM framebuffers are much more stable with modem sleep disabled.
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(true);
  WiFi.begin(APP_WIFI_SSID, APP_WIFI_PASSWORD);
  setStatus("Connecting Wi-Fi", true);

  const unsigned long startedAt = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - startedAt < 15000) {
    delay(200);
  }

  app.wifiReady = WiFi.status() == WL_CONNECTED;
  if (!app.wifiReady) {
    setStatus("Wi-Fi connect failed", true);
    return;
  }

  Serial.printf("Wi-Fi connected, IP=%s\n", WiFi.localIP().toString().c_str());

  bootstrapClockFromBuildTime();

  requestTimeSync();

  const unsigned long clockStartedAt = millis();
  time_t now = time(nullptr);
  while (!isClockValid(now) && millis() - clockStartedAt < 10000) {
    delay(200);
    now = time(nullptr);
  }

  Serial.printf("Clock after SNTP wait: %lld\n", static_cast<long long>(now));

  app.clockReady = isClockValid(now);
  app.rangeStart = startOfLocalDay(app.clockReady ? now : time(nullptr));
  app.rangeEnd = app.rangeStart + (APP_QUERY_DAYS * 24 * 60 * 60);
  setStatus(app.clockReady ? "Syncing calendar" : "Wi-Fi ready, no NTP", true);
}

void refreshIfNeeded() {
  if (app.fetchInProgress) {
    return;
  }

  if (app.refreshDeferredToNextLoop) {
    app.refreshDeferredToNextLoop = false;
    return;
  }

  if (!hasAppConfig()) {
    rebuildAgenda();
    return;
  }

  if (WiFi.status() != WL_CONNECTED) {
    app.wifiReady = false;
    if (millis() - app.lastRefreshMs > 10000 || app.refreshRequested) {
      connectWifi();
    }
  } else {
    app.wifiReady = true;
  }

  if (!app.wifiReady) {
    return;
  }

  const time_t now = time(nullptr);
  if (!isClockValid(now)) {
    app.clockReady = false;
    if (millis() - app.lastClockSyncAttemptMs > APP_NTP_RETRY_INTERVAL_MS) {
      requestTimeSync();
    }
    setStatus("Waiting for time sync", true);
    setRefreshOverlay("", false);
    return;
  }

  if (!app.clockReady) {
    app.clockReady = true;
    app.rangeStart = startOfLocalDay(now);
    app.rangeEnd = app.rangeStart + (APP_QUERY_DAYS * 24 * 60 * 60);
    app.refreshRequested = true;
  }

  const bool stale = millis() - app.lastRefreshMs > APP_REFRESH_INTERVAL_MS;
  if (!app.refreshRequested && !stale) {
    return;
  }

  setRefreshOverlay(app.pullRefreshInProgress ? "Refreshing calendar..." : "Reloading calendar...", true);

  if (app.pullRefreshInProgress) {
    if (!triggerDaemonRefresh()) {
      app.pullRefreshInProgress = false;
      return;
    }
  }

  app.refreshRequested = false;
  if (fetchAgendaWindow()) {
    rebuildAgenda();
  }
  app.pullRefreshInProgress = false;
}

void setupDisplay() {
  touch_init();

  bus = new Arduino_ESP32SPI(GFX_NOT_DEFINED, 39, 48, 47, GFX_NOT_DEFINED);

  // Keep the panel timing at the original board values; the flicker fix comes
  // from the bounce-buffer/manual-flush path rather than porch retuning.
  rgbpanel = new Arduino_ESP32RGBPanel(
      18, 17, 16, 21,
      11, 12, 13, 14, 0,
      8, 20, 3, 46, 9, 10,
      4, 5, 6, 7, 15,
      1, 10, 8, 50,
      1, 10, 8, 20,
      0, GFX_NOT_DEFINED, false,
      0, 0, TFT_BOUNCE_BUFFER_PX, 2);

  gfx = new Arduino_RGB_Display(
      // Manual flush is intentional: auto flush caused frequent idle flicker
      // when the RGB panel scanned from PSRAM.
      480, 480, rgbpanel, 0, false,
      bus, GFX_NOT_DEFINED, st7701_4848s040_init_operations, sizeof(st7701_4848s040_init_operations));

  if (!gfx->begin()) {
    Serial.println("gfx->begin() failed");
  }

  framebufferA = rgbpanel->getFrameBufferByIndex(0);
  framebufferB = rgbpanel->getFrameBufferByIndex(1);
  if (framebufferA == nullptr || framebufferB == nullptr) {
    Serial.println("rgbpanel framebuffers unavailable");
  }

  displayVsyncSemaphore = xSemaphoreCreateBinary();
  if (displayVsyncSemaphore == nullptr) {
    Serial.println("displayVsyncSemaphore create failed");
  } else {
    esp_lcd_rgb_panel_event_callbacks_t callbacks = {};
    callbacks.on_vsync = onRgbVsync;
    rgbpanel->registerEventCallbacks(&callbacks, displayVsyncSemaphore);
  }

  pinMode(GFX_BL, OUTPUT);
  analogWrite(GFX_BL, TFT_BRIGHTNESS);

  gfx->displayOn();
  gfx->fillScreen(BLACK);
  gfx->setRotation((4 - TFT_ROTATION) % 4);
}

void setupLvgl() {
  lv_init();
  lv_tick_set_cb(my_tick);

  lv_display_t *disp = lv_display_create(TFT_HOR_RES, TFT_VER_RES);
  lv_display_set_flush_cb(disp, my_disp_flush);
  lv_display_set_buffers(disp, framebufferA, framebufferB, FRAMEBUFFER_SIZE, LV_DISPLAY_RENDER_MODE_DIRECT);
  lv_display_set_rotation(disp, TFT_ROTATION);

  lv_indev_t *indev = lv_indev_create();
  lv_indev_set_type(indev, LV_INDEV_TYPE_POINTER);
  lv_indev_set_read_cb(indev, my_touchpad_read);
}

void setup() {
  Serial.begin(115200);
  Serial.println("Starting agenda UI");

  setupDisplay();
  setupLvgl();

  app.rangeStart = startOfLocalDay(time(nullptr));
  app.rangeEnd = app.rangeStart + (APP_QUERY_DAYS * 24 * 60 * 60);

  buildUi();
  connectWifi();
  refreshIfNeeded();
}

void loop() {
  lv_timer_handler();
  refreshIfNeeded();
  updateRelativeTimesIfNeeded();
  delay(5);
}
